{
	"welcome": "Witaj wedrowcze. Twoja przygoda zaczyna sie w malej wiosce Debina, polozonej na skraju Wielkiego Lasu. Mieszkancy wioski borykaja sie z problemem - ich zapasy lekarstw koncza sie, a zielarka, ktora zwykle zbierala ziola w lesie, jest chora.",
	
	"adventure_start": "Soltys wioski prosi cie o pomoc. \"Potrzebujemy kogos odwaznego, kto uda sie do lasu i zbierze czerwone kwiaty ciernitrudu, ktore rosna w glebi lasu. To wazny skladnik lekarstw. Jestes zainteresowany?\"",
	
	"choices_main_quest": [
		"Chetnie pomoge", 
		"Potrzebuje wiecej informacji", 
		"To zbyt niebezpieczne"
	],
	
	"accept": "\"Dziekuje! To dla nas bardzo wazne. Nie kazdy mialby odwage zapuszczac sie do lasu.\"",
	
	"more_info": "\"Las bywa niebezpieczny. Sciezki sa zagmatwane, a po zmroku pojawia sie mgla. Czerwone kwiaty ciernitrudu rosna na malej polanie niedaleko starego debu. Zielarka zwykle zabierala mape, ale moglbys tez sprobowac zapytac mysliwego o wskazowki.\"",
	
	"decline_retry": "\"Rozumiem twoje obawy. Las bywa zdradliwy. Moze jednak przemyslisz swoja decyzje? Wioska naprawde potrzebuje pomocy.\"",
	
	"preparations": "Przed wyruszeniem do lasu mozesz sie przygotowac. Co chcesz zrobic?",
	
	"choices_preparation": [
		"Wez mape od zielarki",
		"Zapytaj mysliwego o wskazowki",
		"Kup pochodnie (2 zlote)",
		"Jestem gotowy do drogi"
	],
	
	"tea_lady_map": "Odwiedzasz chora zielarke, ktora z wdziecznoscia daje ci swoja mape. Jest stara i miejscami wyblakla, ale powinna byc pomocna.",
	
	"tea_lady_map_again": "Juz masz mape zielarki.",
	
	"hunter": "Mysliwy poczatkowo niechetnie, ale po twoich przekonujacych argumentach zgadza sie pomoc. Opisuje ci dokladnie jak dojsc do starego debu, gdzie znajduja sie kwiaty ciernitrudu.",
	
	"hunter_again": "Mysliwy burczy cos pod nosem, ale nie uzyskujesz od niego zbyt pomocnych wskazowek. Wyglada na to, ze bedziesz musial radzic sobie sam.",
	
	"torch": "Kupujesz solidna pochodnie od kowala. Bedzie przydatna, jesli zaskoczy cie zmrok w lesie.",
	
	"torch_again": "Juz masz pochodnie.",
	
	"journey_start": "Wyruszasz w kierunku lasu. Mieszkancy zegnaja cie, zyczac powodzenia. Sciezka prowadzi miedzy wysokimi drzewami, a promienie slonca przebijaja sie przez korony.",
	
	"crossroad": "Po godzinie marszu docierasz do rozwidlenia sciezek. Jedna droga prowadzi prosto przez gesty las - wyglada na krotsza, ale trudniejsza. Druga okraza wzgorze - jest dluzsza, ale wydaje sie bezpieczniejsza.",
	
	"choices_crossroad": [
		"Wybierz krotsza, trudniejsza sciezke", 
		"Wybierz dluzsza, bezpieczniejsza droge", 
		"Sprawdz mape (jesli posiadasz)"
	],
	
	"crossroad_map": "Studiujesz mape zielarki. Zaznaczono na niej, ze krotsza sciezka prowadzi przez tereny, gdzie rosna trujace krzaki. Dluzsza droga jest rzeczywiscie bezpieczniejsza, ale zajmie wiecej czasu.",
	
	"difficult_path_prepared": "Dzieki posiadanym wskazowkom, sprawnie nawigujesz przez gestwine, omijajac trujace krzaki. Po pewnym czasie docierasz do malej polany z ogromnym, starym debem.",
	
	"difficult_path_success": "Mimo braku wskazowek, sprawnie przedzierasz sie przez zarosla i docierasz do polany ze starym debem, gdzie rosna czerwone kwiaty.",
	
	"difficult_path_failure": "Przedzieranie sie przez gesty las bez wskazowek okazuje sie trudniejsze niz myslales. Bladzisz przez jakis czas, az w koncu znajdujesz polane ze starym debem.",
	
	"safe_path": "Wybierasz dluzsza, ale bezpieczniejsza sciezke. Droga zajmuje wiecej czasu, ale bez wiekszych trudnosci docierasz do polany ze starym debem, gdzie powinny rosnac czerwone kwiaty ciernitrudu.",
	
	"flowers_success": "Dzieki swojej wiedzy, rozpoznajesz czerwone kwiaty ciernitrudu i ostroznie zbierasz odpowiednia ilosc, unikajac kolcow. Misja zakonczona sukcesem!",
	
	"flowers_failure": "Znajdujesz czerwone kwiaty, ale nie masz pewnosci czy to na pewno ciernitrud. Zbierasz troche, majac nadzieje, ze to wlasciwa roslina. Po drodze kilka razy klujesz sie o kolce.",
	
	"return_journey_difficult": "Z zebranymi kwiatami wracasz ta sama, trudna sciezka. Dzien chyli sie ku koncowi i w lesie robi sie coraz ciemniej.",
	
	"return_journey_safe": "Z zebranymi kwiatami wracasz bezpieczna sciezka. Podroz jest spokojna, choc slonce powoli zachodzi za horyzontem.",
	
	"return_difficult_prepared": "Wracasz do wioski bez problemu dzieki mapie i pochodni. Soltys jest pod wrazeniem twojej sprawnosci i odwagi. Otrzymujesz nagrode i wdziecznosc mieszkancow.",
	
	"return_difficult_unprepared": "Droga powrotna okazuje sie trudniejsza niz sie spodziewales. Docierasz do wioski po zmroku, zmeczony i lekko poobijany. Soltys jest wdzieczny za twoja pomoc, choc martwi sie twoim stanem.",
	
	"return_safe": "Wracasz do wioski spokojnie i bez przeszkod. Soltys dziekuje ci za pomoc i nagradza kilkoma monetami. Mieszkancy sa wdzieczni za twoj wklad.",
	
	"epilogue": "Gratulacje! Ukonczyles prolog. Teraz mozesz kontynuowac swoja przygode w swiecie gry.",
	
	"choices_reconsider": [
		"Dobrze, pomoge wiosce", 
		"Definitywnie odmawiam"
	],
	
	"accept_after_reconsider": "\"Dziekuje! Twoja pomoc jest nieoceniona.\"",
	
	"decline_final": "\"Szkoda, ale rozumiem. Moze znajdziemy innego smialka.\" - konczy rozmowe soltys. Wyglada na to, ze nie jestes zainteresowany ta przygoda. Moze nastepnym razem..."
}